{"meta":{"title":"BlahBlah","subtitle":"TBD","description":"Footprints I Left Behind","author":"wbangbang","url":"http://yoursite.com","root":"/"},"pages":[{"title":"","date":"2020-04-27T20:13:08.000Z","updated":"2020-05-01T01:56:23.719Z","comments":false,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"ProfileHi, this is me. Social Info"},{"title":"categories","date":"2020-04-27T19:52:39.000Z","updated":"2020-05-01T01:56:23.719Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2020-04-27T19:48:52.000Z","updated":"2020-05-01T01:56:23.719Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Set up Blog via Hexo & GitHub Pages","slug":"SetupBlogViaHexo&GitHubPages","date":"2020-05-01T01:56:23.719Z","updated":"2020-05-01T01:56:23.719Z","comments":true,"path":"2020/05/01/SetupBlogViaHexo&GitHubPages/","link":"","permalink":"http://yoursite.com/2020/05/01/SetupBlogViaHexo&GitHubPages/","excerpt":"","text":"Why HexoAccording to this: Some of the features offered by Hexo are: Blazing Fast - Node.js brings you incredible generating speed. Hundreds of files take only seconds to build. Markdown Support - All features of GitHub Flavored Markdown are supported. You can even use most Octopress plugins in Hexo. One-Command Deployment - You only need one command to deploy your site to GitHub Pages, Heroku or other sites. On the other hand, Jekyll provides the following key features: Simple - No more databases, comment moderation, or pesky updates to install—just your content. Static - Markdown (or Textile), Liquid, HTML &amp; CSS go in. Static sites come out ready for deployment. Blog-aware - Permalinks, categories, pages, posts, and custom layouts are all first-class citizens here. Hexo is powered by Node.js, while Jekyll is powered by Ruby. I’m not a fan of Ruby and I’m ramping up on Node.js, so that Hexo sounds more right. SetupPlease ensure you have the following installed before installing hexo: Node.js (Should be at least Node.js 8.10, recommends 10.0 or higher) Git You can easily install Hexo via npm: 1$ npm install -g hexo-cli This section only shows a simple installation. For more details or advanced installation, you may want to refer to here. 123$ hexo init &lt;folder&gt;$ cd &lt;folder&gt;$ npm install For more details or advanced installation, you may want to refer to here. DeploymentHow to get your Hexo blog deployed on GitHub Pages? You may want to check the tutorial here. For Step#2, to push your local folder into GitHub, you can do the following: 12345678910111213141516171819$ cd &lt;current_working_directory_of_your_local_project&gt;# Initialize the local directory as a Git repository.$ git init# Add all the files in your new local repository.$ git add .# Commit them.$ git commit -m &quot;First commit&quot;# Copy the remote repository URL and paste below to set it as remote$ git remote add origin &lt;remote_repository_URL&gt;# Verifies the new remote URL$ git remote -v# Push the changes in your local repository to GitHub.$ git push origin master (Reference). Step#8~#10 are not accurate: Please see a GitHub’s document About GitHub Pages: The default publishing source for user and organization sites is the master branch. If the repository for your user or organization site has a master branch, your site will publish automatically from that branch. You cannot choose a different publishing source for user or organization sites. This being said, you cannot change the source. Instead, you need the following: 1234567891011121314151617181920sudo: falselanguage: node_jsnode_js: - 10cache: npmbranches: only: - hexo-source # store source code of hexo in hexo-source branchscript: - hexo generatedeploy: provider: pages skip-cleanup: true github-token: $GH_TOKEN keep-history: true # added target_branch: master # generate static files to master on: branch: hexo-source # source code of hexo local-dir: public And you need to create a new branch hexo-generate and use it to store your source code; and use master to store built artifacts. You may want to refer to How do you track a remote branch? and Make an existing Git branch track a remote branch? . Troubleshooting","categories":[],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://yoursite.com/tags/Hexo/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-05-01T01:56:23.719Z","updated":"2020-05-01T01:56:23.719Z","comments":true,"path":"2020/05/01/hello-world/","link":"","permalink":"http://yoursite.com/2020/05/01/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://yoursite.com/tags/Hexo/"},{"name":"Misc","slug":"Misc","permalink":"http://yoursite.com/tags/Misc/"}]}],"categories":[],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://yoursite.com/tags/Hexo/"},{"name":"Misc","slug":"Misc","permalink":"http://yoursite.com/tags/Misc/"}]}